Certification/src/InformationRegisters/ПользователиАбонентов/ПользователиАбонентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПользователиАбонентов</name>
  <resources>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.Сервисы</types>
    </type>
  </resources>
  <dimensions>
    <name>Абонент</name>
    <type>
      <types>CatalogRef.Абоненты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПользовательСервиса</name>
    <type>
      <types>CatalogRef.ПользователиСервисов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Certification/src/InformationRegisters/ПользователиАбонентов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

// Возвращает пользователей абонента
//
Функция ПользователиАбонента(Абонент) Экспорт
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = 
    	"ВЫБРАТЬ
        |	ПользователиАбонентов.ПользовательСервиса
        |ИЗ
        |	РегистрСведений.ПользователиАбонентов КАК ПользователиАбонентов
        |ГДЕ
        |	ПользователиАбонентов.Абонент = &Абонент";
    
    Запрос.УстановитьПараметр("Абонент", Абонент);
    
    Результат = Запрос.Выполнить();
    Если Результат.Пустой() Тогда
    	Возврат Новый Массив
    Иначе
        Возврат Результат.Выгрузить().ВыгрузитьКолонку("ПользовательСервиса");
    КонецЕсли; 
	
КонецФункции

#КонецОбласти

#КонецЕсли
